---
kind: type
id: T:Autodesk.Revit.DB.RevisionNumberType
source: html/9bbde707-5b86-1f51-d6a4-7c12cb8ac6e5.htm
---
# Autodesk.Revit.DB.RevisionNumberType

Determines how a particular revision will be numbered.

## Syntax (C#)
```csharp
public enum RevisionNumberType
```